a = input("Напишите любой месяц и мы определим время года. Ваш месяц: ").lower()
b = [["декабрь", "зима"], ["январь", "зима"], ["февраль", "зима"],
     ["март", "весна"], ["апрель", "весна"], ["май", "весна"],
     ["июнь", "лето"], ["июль", "лето"], ["август", "лето"],
     ["сентябрь", "осень"], ["октябрь", "осень"],["ноябрь", "осень"]]
dictionary = {"декабрь": "зима", "январь": "зима", "февраль": "зима",
"март": "весна", "апрель": "весна", "май": "весна",
"июнь": "лето", "июль": "лето", "август": "лето",
"сентябрь": "осень", "октябрь": "осень", "ноябрь": "осень"}

print(f"{a.title()} - это {dictionary[a]}.")

for i in range(len(b)):
    if a == b[i][0]:
        print(f"{a.title()} - это {b[i][1]}.")
        break


