# Пользователь вводит месяц в виде целого числа
# от 1 до 12.
# Сообщить к какому времени года относится месяц
# (зима, весна, лето, осень).
# Напишите решения через list и через dict.

my_list = [[1, "январь", "зима"],
           [2, "февраль", "зима"],
           [3, "март", "весна"],
           [4, "апрель", "весна"],
           [5, "май", "весна"],
           [6, "июнь", "лето"],
           [7, "июль", "лето"],
           [8, "август", "лето"],
           [9, "сентябрь", "осень"],
           [10, "октябрь", "осень"],
           [11, "ноябрь", "осень"],
           [12, "декабрь", "зима"]]
my_dict = {1: "зима",
           2: "зима",
           3: "весна",
           4: "весна",
           5: "весна",
           6: "лето",
           7: "лето",
           8: "лето",
           9: "осень",
           10: "осень",
           11: "осень",
           12: "зима"}
user_month = int(input("Введите месяц в виде целого числа:\n"))

for el in my_list:
    if el[0] == user_month:
        print(f"Месяц - {el[1]}, время года - {el[2]}.")

print(f"Время года - {my_dict[user_month]}.")
